const REVIEW = `
🌟 <b>Мы ценим Ваше мнение!</b> ✨

📝 Поделитесь своими впечатлениями, идеями, чтобы улучшить наши услуги и сделать их более полезными. 💬
`;

const THANKS_FOR_REVIEW = `
🙏 <b>Спасибо за отзыв, он сделает бота лучше для Вас!</b> 🚀
`;

const ABOUT = `
👋 <b>купи ДЕШЕВЛЕ ⚡️ - Ваш верный спутник в мире экономии и умных покупок!</b> 💰

🔍 <b>Как это работает?</b>

Отправьте ссылку на товар, который Вам интересен из списка доступных платформ, и бот будет следить за ценой. <b>Как только она станет ниже, <u>придёт уведомление!</u></b> 💸

💡 <b>Почему стоит пользоваться?</b>

С помощью бота Вы сможете не только экономить на покупках, но и освободить время от рутины постоянного мониторинга цен. <b>Теперь можно быть уверенным, что Ваши покупки <u>происходят вовремя и по выгодной цене!</u></b> ⏰

🌟 <b>Не упускайте выгодные предложения и совершайте покупки правильно с купи ДЕШЕВЛЕ ⚡️</b>
`;

const DICTIONARY = `
📖 <b>Словарик бота</b>

⌛️ <b>Частота проверки</b> - это периодичность, с которой будут проверяться указанные Вами товары.

📎 <b>Ссылка</b> - строка, которая копируется из браузера или мобильного приложения для того, чтобы бот мог начать мониторить цену.

<i>Подробнее о том, где взять ссылку на товар, можно узнать из инструкции</i>
`;

const DONATION = `
💰 <b>Если Вы хотите поддержать развитие проекта финансово, отправьте любую сумму, которая Вам удобна</b>

💳 <code>2202208077656883</code> (<b>Артём К.</b>)

📈 Ваши пожертвования пойдут на дальнейшее развитие и улучшение бота, чтобы Вы могли экономить ещё больше!

🚀 Благодарим Вас за поддержку и доверие! Вместе мы сможем сделать сервис только выгодных покупок! 💪
`;

const SUPPORT = `
🤝 Нужна помощь или возникли вопросы?

😎 <b>Поддержка всегда на связи, чтобы помочь Вам!</b>

🙂 Напишите нам, чтобы мы смогли решить Вашу проблему

Наш чат: @cheaper_purchases_support
`;

export { REVIEW, THANKS_FOR_REVIEW, ABOUT, DICTIONARY, DONATION, SUPPORT };
