const START = `
⭐️ <b>Купи ДЕШЕВЛЕ ⚡️ - Ваш личный помощник для экономии на покупках</b> 🤖

🎉 Как только указанный товар станет дешевле, придёт уведомление, чтобы покупка стала ещё выгоднее 💰

📎 Отправьте ссылку на интересующий продукт, и бот начнёт ловить скидки <b>%</b>

🛍 <b>Узнавайте о выгодных предложениях по Вашей корзине раньше всех!</b> 💯

💸 <u>А ещё бот всегда поможет найти более выгодную цену среди магазинов</u> 🔎

🆓 <b>Бот полностью бесплатный</b> 🔥
`;

const ADDING_AT_START = `
💸 <b>Начать экономить очень просто!</b>

⚡️ Отправьте ссылку на любимый товар боту из списка платформ ниже ↓
⌛️ <u>Это займёт не более 15 секунд</u>
`;

const START_ERROR = `
🛠️ Сервис временно не работает 😔
`;

const WRONG_MESSAGE = `
😕 Сообщение не получилось распознать

🔍 Убедитесь, что введена правильная команда или сообщение

😉 <b>Вы всегда можете воспользоваться встроенной клавиатурой бота</b>
`;

const ERROR = `
Ошибка сервиса 😖

Попробуйте повторить операцию немного позже ⌛

<i>Если проблема не уходит, обратитесь в службу поддержки</i> ️⚙
`;

export { START, ADDING_AT_START, START_ERROR, WRONG_MESSAGE, ERROR };
