const NO_GOODS = `
😔 <b>У вас нет добавленных товаров</b>

😎 <i>Попробуйте добавить - это просто!</i> ↓
`;

const LIMIT_REACHED = `
😔 <b>Достигнут лимита по числу товаров в подписке</b>
 
🎁 <i>Всегда можно пригласить новых пользователей по Вашей уникальной ссылке, тогда Вы и друг получите <u>дополнительные ссылки</u></i>

📝 Также можно отредактировать текущий список с товарами
`;

const WAITING_UNTIL_NEXT_CALL = `
🙂 Подождите немного, прежде чем получить данные о всех товарах повторно

⌛️ <b>Число секунд до следующего запроса: </b>`;

export { NO_GOODS, LIMIT_REACHED, WAITING_UNTIL_NEXT_CALL };
