const REFERRAL_FIRST_PART = `
🎉 <b>Приглашайте друзей и получайте бонусы!</b> 🎁

🚀 Вы можете отправить свою уникальную ссылку друзьям, тогда <b>Вы и друг получите по <u>3 дополнительные ссылки!</u></b> ✨

`;

const REFERRAL_SECOND_PART = `
↑ <i>Нажмите, чтобы скопировать</i> ↑

😉 Также можно получить заготовленный текст для отправки, так друг узнает о всех преимуществах бота! 😎
`;

const PREPARED_REFERRAL = `
⭐️ <b>купи ДЕШЕВЛЕ ⚡️ помогает совершать выгодные покупки</b>

❓ <b>Как он это делает?</b>

📎 Вы присылаете боту ссылку на интересующий товар, дальше с определённой регулярностью <u>проверяется цена, если она стала меньше, то сразу же уведомляет</u>

💸 <b>Теперь не получится пропустить снижение цен</b> 

👑 В боте есть <u>бесплатная подписка навсегда</u>
`;

const ONLY_FOR_NEW = `
🌟 <b>Приглашать можно только новых пользователей</b>

🎁 Попробуйте позвать друзей, которые не используют бота, тогда <u>Вы и друг получите дополнительный набор ссылок!</u>
`;

export {
    REFERRAL_FIRST_PART,
    REFERRAL_SECOND_PART,
    PREPARED_REFERRAL,
    ONLY_FOR_NEW,
};
