const BUY = `
💰 Как получать ещё больше выгоды?

1️⃣ <i>Узнать о снижении цены раньше всех</i>
⚡️️ <b>Ускорим частоту просмотра всех товаров!</b>

2️⃣ <i>Собрать большую корзину любимых товаров</i>
📎 <b>Добавим столько ссылок, сколько нужно Вам!</b>

3️⃣ <i>Иметь премиальное обслуживание поддержки</i>
📝 <b>Быстро ответим на вопросы, чтобы экономия не останавливалась ни на секунду!</b>

<u>Получить всё можно написав в поддержку:</u> <code>Больше выгоды</code>

Чат: @cheaper_purchases_support

💯 <b>Попробуйте и убедитесь в выгоде сами!</b>

🔥 <b>Первые 20 пользователей получат скидку 50%!</b> 
`;

// 👑 <i>Пользователей с повышенной выгодой [3/20]</i>

const READY_SUBSCRIPTION = `
💰 Как получать ещё больше выгоды?

👑 <b>Попробуйте одну из выгодных подписок и <u>пользуйтесь лучшими преимуществами!</u></b>

😉 <i>Автопродление всегда можно отменить в разделе с подпиской, чтобы пользование ботом было только в выгоду</i>

☺️ <b>Попробуйте прямо сейчас и убедитесь в выгоде сами!</b>

👇 <i>Выбирите одну из подписок, чтобы ознакомитьс с тарифом, дальше можно выбрать удобный для Вас период оплаты</i>
`;

const FIRST_LEVEL_SUBSCRIPTION = ` - 
`;

const SECOND_LEVEL_SUBSCRIPTION = ` - 
`;

const THIRD_LEVEL_SUBSCRIPTION = ` - 
`;

export {
    BUY,
    READY_SUBSCRIPTION,
    FIRST_LEVEL_SUBSCRIPTION,
    SECOND_LEVEL_SUBSCRIPTION,
    THIRD_LEVEL_SUBSCRIPTION,
};
